[
{
"id":"01",
"title": "Grammar Quiz",
"imgUrl": "projects/portfolioImg1.jpg",
"description": "I created this project to fulfil a need for my child to practise answering grammar-related questions before his SATS (UK school standard assessment tests for 10-11 year-olds).", 
"description2": "I used the questions from paper 1 of the SATs spelling, punctuation and grammar exams from 2017 to 2023, re-purposing non-multiple choice questions into multiple choice questions. Animations that give immediate feedback on responses make this quiz easy and compelling to use.",
"skills": ["JavaScript/ES6", "Educational websites"],
"siteUrl": "https://nadia982.github.io/sats-spag-quiz/",
"gitHub": "https://github.com/Nadia982/sats-spag-quiz",
"alt": "A screenshot of project 1: a multiple choice quiz about English grammar on a dark blue background with four possible answers. At the bottom of the screen there are answer indicators indicating whether previous questions have been answered correctly."
},

{
"id":"02",
"title": "Spelling Game",
"imgUrl": "projects/portfolioImg2.jpg",
"description": "I created this project to fulfil a need for my child to learn and practise certain spellings before his SATS (UK school standard assessment tests for 10-11 year-olds).", 
"description2": "This app is similar to Wordle, except that it allows words of differing lengths and provides an option for the word and its definition to be read out loud using the SpeechSynthesis API.",
"skills": ["JavaScript/ES6", "APIs", "Educational websites"],
"siteUrl": "https://nadia982.github.io/spelling-game-letters-in-order/",
"gitHub": "https://github.com/Nadia982/spelling-game-letters-in-order",
"alt": "A screenshot of project 2: a spelling game where the word 'feasible' is spelled out correctly."
},
{
"id":"03",
"title": "Travel website",
"imgUrl": "projects/portfolioImg3.jpg",
"description": "A concept landing page for a fictional luxury travel company created using React and styled components.",
"skills": ["React", "Styled components", "Small business websites"],
"siteUrl": "https://nadia982.github.io/dream-travel/",
"gitHub": "https://github.com/Nadia982/dream-travel",
"alt": "A screenshot of project 3: a travel website with a purple and blue colour scheme showing ethereal photos of Singapore, Thailand and Paris."
},
{
    "id":"04",
    "title": "Word Scramble",
    "imgUrl": "projects/portfolioImg4.jpg",
    "description": "I created this project to fulfil a need for my child to learn and practise spellings before a test. The app presents a scrambled version of the word and requires the user to type the unscrambled word. The user can choose for the word and its definition to be read out loud using the SpeechSynthesis API, and volume can be controlled using an accessible onscreen volume slider. ",
    "description2": "The app is fully navigable using the keyboard. Ideal for reluctant spellers as instant feedback is given if the word inputted is too long, and the correct answer is provided after 3 incorrect guesses.",
    "skills": ["JavaScript", "APIs", "Educational websites"],
    "siteUrl": "https://nadia982.github.io/word-scramble/",
    "gitHub": "https://github.com/Nadia982/word-scramble",
    "alt": "A screenshot of project 4: a word scramble game on a light blue background."
    }
]
